Revit 2027 API
PointCloudOverrideSettings.GetModeOverride Method
 Lookup color settings for the given color mode.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PointCloudColorSettings GetModeOverride(
	PointCloudColorMode mode
)
Public Function GetModeOverride (
	mode As PointCloudColorMode
) As PointCloudColorSettings
public:
PointCloudColorSettings^ GetModeOverride(
	PointCloudColorMode mode
)
member GetModeOverride :
        mode : PointCloudColorMode -> PointCloudColorSettings
Parameters
mode PointCloudColorMode
 Color mode for which to lookup the color settings.
Return Value
PointCloudColorSettings
 Color settings stored for the given color mode or default color settings if nothing is stored for the given color mode.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PointCloudOverrideSettings Class
Autodesk.Revit.DB.PointClouds Namespace